_site/app/controllers/reviews_controller.rb

SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    @videos = Video.find(params[:video_id])

INSERT INTO "reviews" ("user_id", "video_id", "body_lang_rating", "body_lang_comments", "vocal_rating", "vocal_comments", "content_rating", "content_comments", "overall_rating", "overall_comments", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    Review.create(review_params)