_site/app/views/videos/index.html.erb

    <div id="vid-text"><strong>Author: </strong></div>
    <div id="vid-text"><%= User.find(video.user_id).first_name%> <%= User.find(video.user_id).last_name%></div>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]