app/views/videos/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."video_id" = ?  [["video_id", 1]]
---
<h2>Reviews</h2>
<% @video.reviews.each do |review| %>