app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.save
---
INSERT INTO "users" ("first_name", "last_name", "username", "password", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["first_name", "jason"], ["last_name", "xu"], ["username", "a"], ["password", "a"], ["email", "a@a.com"], ["created_at", "2015-09-11 15:00:23.495184"], ["updated_at", "2015-09-11 15:00:23.495184"]]