app/controllers/videos_controller.rb

  def index
    @videos = Video.all
    # VideoInfo.provider_api_keys = { youtube: 'YOUR_YOUTUBE_API_KEY', vimeo: 'YOUR_VIMEO_API_KEY' }
    @users = User.all
    @user = User.find(session[:user_id])
---
SELECT "videos".* FROM "videos"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @user = User.find(params[:user_id])
    # p @user
    # @video = Video.new(user_video_params)
    # @videos = Video.all
    @video = @user.videos.new(
      title: params[:video][:title],
      user_id: params[:user_id],
      video_link: params[:video][:video_link]
    )
    if @video.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "videos" ("title", "user_id", "video_link", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "hi"], ["user_id", 1], ["video_link", "https://www.youtube.com/watch?v=8ONf8SXbGZ4"], ["created_at", "2015-09-11 15:00:54.272291"], ["updated_at", "2015-09-11 15:00:54.272291"]]

  def show
    params[:video_id] = params[:id]
    @video = Video.find(params[:id]) #the video id
    @user = User.find(session[:user_id])
    @reviews = Review.where(video_id: @video.id)
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."video_id" = ?  [["video_id", 1]]

  def edit
    @video = Video.find(params[:id]) #the video id
    @user = User.find(session[:user_id])
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]

  def update
    @video = Video.find(params[:id]) #the video id
    @user = User.find(session[:user_id])
    @video.update(
      title: params[:video][:title],
      user_id: params[:user_id],
      video_link: params[:video][:video_link]
    )
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "videos" SET "title" = ?, "video_link" = ?, "updated_at" = ? WHERE "videos"."id" = ?  [["title", "real men 5 tips of public speaking"], ["video_link", "https://www.youtube.com/watch?v=x9E8yaFCX0Y"], ["updated_at", "2015-09-15 09:04:39.712600"], ["id", 5]]

  def destroy
    @video = Video.find(params[:id])
    @user = User.find(session[:user_id])
    @video.destroy
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "videos" WHERE "videos"."id" = ?  [["id", 1]]